// Movepage.js
function moveto_top(){
		$('.loading_screen').css('opacity','1');
		//setTimeout(function(){$('.panel-main').css('text-align','center');},4999);
		setTimeout(function(){
			$('.page_top').html("<h1>コードで、あなたの未来を描く。</h1>");
			$('.panel-main').html("<h2>デジタルを学ぶ。デジタルで学ぶ。</h2><h2>インターネットが大好きなあなたのための、通信制高校です。</h2><br>学校法人信学会で新たな仲間と、インターネットを活用し自分のペースで高校卒業をめざします。<br><br>これからの社会で活躍するために、プログラミングの基礎も学びます。<br><br>自分の好きを活かして、「こんなアプリがあったらな」「こんなゲームが作れたら」と、<br>自らのアイディアを形にする。新しいタイプの学校です。<br><br>今はまったくプログラミングができなくても大丈夫。<br>気のあう仲間と「進学に向け勉強してみたい」「インターネットやコンピュターを学んでみたい」<br>新入生・転入生のみなさん、コードアカデミー高校であなたの未来を描いてみませんか。<br>");
		},5000);
		setTimeout(function(){$('body').css('background-image','url(img/top_01.jpg)');},5002);
		setTimeout(function(){$('.loading_screen').css('opacity','0');},5003);
}

function moveto_guide(){
		$('.loading_screen').css('opacity','1');
		setTimeout(function(){
			$('.page_top').html("<h1>未来を変える、もう一つの新しい道。</h1>");
			$('.panel-main').html("<h2>学校の特色</h2><br><br><h3>新しい仲間と学ぶ、もうひとつの道。</h3><br>デジタルが好きな仲間と、コ−ド（プログラム）の基礎を学ぶことで、新たな未来を切り拓いていきます。<br>当校では、コード（プログラミング）学習を必修とし、基礎を学び、自分のプロジェクトを持って、<br>アプリやWEBサービス、ゲーム等自らのアイディアを形にすることができる人を育てていきます。さらに進学に向けて挑戦してみたい人を応援します。<br>ネットやパソコン、アプリやゲームに興味のあり、新しい仲間とチャレンジをしてみたい、みなさんのための学校です。<br><br><h2>特色１.「パソコンやネット好きな仲間と出会える！」ってホントですか？</h2><br>はい、本当です。コード学習を特色とする当校では、インターネットやプログラミング、最新のテックなどに興味がある生徒が集まりますので、共通の話題も多く、一生を通じて付き合える仲間とで出会うことができるでしょう。またプログラミングを通して年齢の異なるメンターとの出会いも、将来の進路選択の大きなきっかけになると思います。<br><h2>特色２.「プログラミングを学びながら、高校卒業資格が取れる！」ってホントですか？</h2><br>はい、本当です。当校では通信制高校として英語や社会といった普通科目も学習しながら、３年間で普通高校を卒業することができます。　他校からの転校生や編入生などは前籍高校の修得単位を生かして、前籍高校と合わせて計３年間で卒業することもできますので、まずはお気軽にお問い合わせください。また本校の特色として全体の講座のうち、約3分の1をプログラミング学習に当てています。しかも高校卒業と専門学校のWスクールではなく、当校は高校の正課として学習できます。プログラミングは初めてという方も、安心して学び始められるカリキュラムですので、インターネットやパソコンが大好き！というみなさんはにはぴったりです。<br>また、IT企業などで活躍しているエンジニアのゲスト講義や、IT企業との共同プロジェクトを通した学びが、自分の将来を考えるヒントになることでしょう。コード学習についてはこちらもご覧ください。<br><h2>特色３.「インターネットが教室だから、自分のペースで学べる！」ってホントですか？</h2><br>はい、本当です。<br>通信制高校では自宅での添削課題（レポート）が、学習の基本になります。日常の学習はインターネット上のクラスルームを活用して、自宅にいながら行います。メディア視聴学習や添削課題の作成・提出もインターネットでOK。さらに、ネット上でディスカッションをしたり、生徒間のコミュニケーションをとることもでき、仲間と一緒に学ぶ環境を実現しています。<br>様々な理由で、毎日学校に通うことができない生徒でも、ネット環境さえあれば、いつでもどこでも自分のペースで学ぶことができ、3年間で高校を卒業することができます。また、高校時代からインターネットを使いこなし、人とつながりながら学んでいくというスキルは、これからの社会では大きなアドバンテージとなることでしょう。<br><h2>特色４.「大学などへの進学指導も万全！」ってホントですか？</h2><br>はい、本当です。当校を卒業した後の進路は、「プログラマーとして就職」「アプリ開発などで起業（自分で会社を作ること）」の他に、「大学や専門学校への進学」も目指すことができます。コードアカデミー高等学校を運営している学校法人信学会は大学受験予備校（駿台提携上田予備学校）も設置しており、文系理系を問わず大学進学の指導ノウハウも万全ですので、進学志望のみなさんもご安心ください。<br>");
		},5000);
		setTimeout(function(){$('body').css('background-image','url(img/guide_01.jpg)');},5002);
		setTimeout(function(){$('.loading_screen').css('opacity','0');},5003);
}
